public/themes/app/Models/Fakultas_model.php

SELECT *
FROM `fakultas`
SELECT *
FROM `fakultas`
WHERE `fak_id` = '1'
---
public function getFakultas($id = false)
    {
        if($id === false){
        return $this->findAll();
        } else {
        return $this->getWhere(['fak_id' => $id]);

INSERT INTO `fakultas` (`fak_nama`, `fak_jmlprodi`, `fak_lokasi`) VALUES ('Teknik', '4', 'Kampus 2')
---
    public function insertFakultas($data)
    {
        return $this->db->table($this->table)->insert($data);

UPDATE `fakultas` SET `fak_nama` = 'Teknik indo', `fak_jmlprodi` = '4', `fak_lokasi` = 'Kampus 2'
WHERE `fak_id` = '1'
---
    public function updateFakultas($data, $id)
    {
        return $this->db->table($this->table)->update($data, ['fak_id' => $id]);

DELETE FROM `fakultas`
WHERE `fak_id` = '2'
---
    public function deleteFakultas($id)
    {
        return $this->db->table($this->table)->delete(['fak_id' => $id]);